# 어제는 밤새 눈이 많이 내려서, 구름이네 집 앞 골목에는 눈이 수북이 쌓여있다. 눈이 많이 쌓여 있으면 사람들이 지나다니기 힘드므로, 구름이는 골목에 쌓인 눈들을 쓸어서 치워버리려고 한다.

# 구름이네 집 앞 골목의 길이는 총 Nm이다. 구름이는 효율적으로 골목을 청소하기 위해 골목의 시작점을 기준으로 하여 1m 단위로 구간을 나눴다. 시작점을 포함하고 있는 구간이 첫 번째 구간, 그 옆에 붙어 있는 구간이 두번째 구간, …., 시작점과 가장 멀리 떨어진 구간이 N번쨰 구간이라고 하자.

# 현재 i번째 구간에는 A(i), 만큼의 눈이 쌓여 있다. 눈을 한번에 다 치우는 것은 힘든 일이므로, 구름이는 총 M번에 걸쳐서 눈을 치울 것이다. 구름이는 매번 눈을 치우기 전, S(i)번째 구간부터 e(i)번째 구간까지 눈을 치우기로 계획한다. 그런 다음 아래와 같이 눈을 치워나가기 시작한다.

# - S(i)번째 구간에 쌓여 있는 눈을 골목의 시작점과 반대 방향으로 쓸어낸다. 그러면 S(i)번째 구간에 쌓인 눈의 양은 0이 되고, S(i) + 1번째 구간에 쌓인 눈의 양은 직전에 S(i)번째 구간에 쌓여있었던 눈의 양만큼 증가한다. 이를 S(i) +1,……..,e(i) 번째 구간에 대해 반복한다

# 구름이가 계획대로 눈을 모두 치웠을 때,. 각 구간에 쌓여있는 눈의 양을 구해보자.

# 입력

# - 3 ≤ N ≤ 200000
# - 1 ≤ M ≤ 200000
# - 1 ≤ A(i) ≤ 1000
# - 1 ≤ S(i) ≤ e(i) ≤ N
# - 입력에서 주어지는 모든 수는 정수이다.

# 출력

# 예시1

# 입력

# 6 2 

# 6 3 2 4 7 9

# 3 5

# 1 2

# 출력

# 0 0 9 0 0 22

def solution(snow,slicing):
    
    for start, end in slicing:
        start -= 1
        amount = 0
        for i in range(start, end):
            amount += snow[i]
            snow[i] = 0
        if end < len(snow):
            snow[end] += amount
        else:
            snow[-1] = amount
        
    return snow

snow = [6,3,2,4,7,9]
slicing = [(3,5),(1,2)]

print(solution(snow,slicing))